InformationRegisters/БухучетРезервовПоОплатеТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>БухучетРезервовПоОплатеТруда</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СпособОтраженияРезервовПоОплатеТрудаВБухучете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВБухУчете</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатьяФинансированияРезервовПоОплатеТруда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиФинансированияЗарплата</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗапрета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Резерв</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Резервы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СпособОтраженияЗарплатыВБухучете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВБухУчете</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяФинансированияЗарплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиФинансированияЗарплата</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийРезервовПоОплатеТруда</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НаправленияРасчетовРезервовПоОплатеТруда</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/БухучетРезервовПоОплатеТруда/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект[0], ДанныеЗаполнения);
		
		ДанныеЗаполненияОрганизация = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаполнения, "Организация");
		Если ТипЗнч(ДанныеЗаполненияОрганизация) = Тип("СписокЗначений") Тогда
			Для Каждого СтрокаСписка Из ДанныеЗаполненияОрганизация Цикл
				Если ЗначениеЗаполнено(СтрокаСписка.Значение) Тогда
					ЭтотОбъект[0].Организация = СтрокаСписка.Значение;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		ДанныеЗаполненияРезерв = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаполнения, "Резерв");
		Если ТипЗнч(ДанныеЗаполненияРезерв) = Тип("СписокЗначений") Тогда
			Для Каждого СтрокаСписка Из ДанныеЗаполненияРезерв Цикл
				Если ЗначениеЗаполнено(СтрокаСписка.Значение) Тогда
					ЭтотОбъект[0].Резерв = СтрокаСписка.Значение;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьСтатьиФинансированияЗарплата") Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "СтатьяФинансированияЗарплаты");
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "СтатьяФинансированияРезервовПоОплатеТруда");
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "СпособОтраженияЗарплатыВБухучете");
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "СпособОтраженияРезервовПоОплатеТрудаВБухучете");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если Количество() = 0 Или РегистрыБЗК.ЭтоУдалениеНабораЗаписей(Замещение) Тогда
		Возврат;
	КонецЕсли;
	
	Если РегистрыБЗК.ЭтоЗамещениеНабораЗаписей(Замещение) Тогда
		Если РегистрыСведений.БухучетРезервовПоОплатеТруда.НайденЗапретИзмененияДанных(Мин(ЭтотОбъект[0].Период, ЭтотОбъект[0].ДатаЗапрета)) Тогда
			Если ЗначениеЗаполнено(ЭтотОбъект[0].ДатаОкончания) Тогда
				Если РегистрыСведений.БухучетРезервовПоОплатеТруда.НайденЗапретИзмененияДанных(ЭтотОбъект[0].ДатаОкончания) Тогда
					Возврат;
				КонецЕсли;
			ИначеЕсли ЭтотОбъект[0].Период = ЭтотОбъект[0].ДатаЗапрета Тогда
				Возврат;
			КонецЕсли;
			ЭтотОбъект.ДополнительныеСвойства.Вставить("ПропуститьПроверкуЗапретаИзменения", Истина);
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		ПараметрыВычисленияВеса = РегистрыСведений.БухучетРезервовПоОплатеТруда.ПараметрыВычисленияВеса();
		ЗаполнитьЗначенияСвойств(ПараметрыВычисленияВеса, Запись);
		Запись.Вес = РегистрыСведений.БухучетРезервовПоОплатеТруда.ВесВсехПоказателей(ПараметрыВычисленияВеса);
		Запись.Приоритет = РегистрыСведений.БухучетРезервовПоОплатеТруда.Приоритет(Запись.Вес);
		Запись.ДатаЗапрета = ?(ЗначениеЗаполнено(Запись.ДатаОкончания) И Запись.ДатаОкончания > Запись.Период, Запись.ДатаОкончания, Запись.Период);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
